[{
    "id": "mf_white_witch",
    "source": "SSC",
    "name": "WHITE WITCH",
    "mechtype": [
      "Defender"
    ],
    "y_pos": 28,
    "license_level": 2,
    "description": "<p>A proof of concept more than a line-production chassis, there have been select releases of White Witch licenses by Smith-Shimano&rsquo;s LUX-Exotic group to elite military enclaves, most notably to the upper cadres of the House of Moments.</p> <p>The White Witch builds on the platform established by the Black Witch; utilizing SSC&rsquo;s signature magtech weapons and equipment, it takes Black Witch and tunes it for hypersolipsistic focus, narrowing the effect cone to encompass only the White Witch and its pilot.</p> <p>The White Witch marks SSC&rsquo;s first foray into null-ordnance/environmental-manipulation chassis. When active, its entire chassis becomes a conduit for onboard base-compound magtech agitators to exploit its immediate environment, drawing atomic components out of organic and inorganic objects and surfaces to enhance its built-in defensive systems. The White Witch reorganizes these molecular draws using its chassis as substrate, quickly forming substantive defenses and weapons from &ldquo;thin air&rdquo;.</p> <p>This process has understandably traumatic effects on organic and inorganic materials inside the immediate effect cone.&nbsp;</p>",
    "mounts": [
      "Flex",
      "Heavy"
    ],
    "stats": {
      "size": 2,
      "stress": 4,
      "structure": 4,
      "armor": 0,
      "hp": 7,
      "evasion": 10,
      "edef": 6,
      "heatcap": 4,
      "repcap": 5,
      "sensor_range": 5,
      "tech_attack": 0,
      "save": 11,
      "speed": 6,
      "sp": 6
    },
    "traits": [{
        "name": "Rooted",
        "description": "While this mech is Immobilized, it has resistance to Kinetic damage and cannot be knocked back or knocked prone. It can choose to become immobilized until the end of its next turn as a protocol."
      },
      {
        "name": "Harden",
        "description": "When this mech braces, it gains Overshield 5 before taking damage.",
        "synergies": [{
          "locations": ["brace"],
          "detail": "When this mech braces, it gains Overshield 5 before taking damage."
        }]
      }, {
        "name": "Fluid Burst",
        "description": "When an allied character in Range 2 of this mech takes damage, it can reduce the damage by 1 and deal 1 AP kinetic damage to itself."
      },
      {
        "name": "Guardian",
        "description": "Adjacent allied characters can use this mech as hard cover."
      }
    ],
    "core_system": {
      "name": "FERROREACTIVE SHELL",
      "description": "“The first test nearly ended the program. Exotic Materials is a … liberal department within the Constellation, but even our executives were hesitant to approve a second run. The data generated by WW_01 was invaluable, and we were sure we could get it right with a second test – all we needed was the sigma on its rewrite cone! Suits just get leery when systems fail. They forget that progress takes blood – sometimes literally – as payment for a breakthrough.”",
      "active_name": "Hyperactive mode",
      "active_effect": "For the rest of the scene, Ferroreactive Armor gives +2 Armor each time instead of +1, to a max of +12. Each time your armor increases in this way, your mech deals 1 AP kinetic damage to all characters in a Burst 1 area as it draws raw material from the environment. If your benefit from Ferroreactive Armor would increase past +12, it explodes instead, dealing 1 AP kinetic damage in a Burst 2 area around you. All characters within the affected area must succeed on a HULL save or be knocked PRONE, then IMMOBILIZED and SHREDDED until the end of their next turns. The benefit from Ferroreactive Armor resets to 0, although it continues to be active and this effect can occur multiple times in a scene.",
      "active_synergies": [{
        "locations": ["armor"],
        "detail": "For the rest of the scene, Ferroreactive Armor gives +2 Armor each time instead of +1, to a max of +12. Each time your armor increases in this way, your mech deals 1 AP kinetic damage to all characters in a Burst 1 area as it draws raw material from the environment. If your benefit from Ferroreactive Armor would increase past +12, it explodes instead, dealing 1 AP kinetic damage in a Burst 2 area around you. All characters within the affected area must succeed on a HULL save or be knocked PRONE, then IMMOBILIZED and SHREDDED until the end of their next turns. The benefit from Ferroreactive Armor resets to 0, although it continues to be active and this effect can occur multiple times in a scene."
      }],
      "use": "Encounter",
      "activation": "Protocol",
      "passive_name": "Ferroreactive Armor",
      "passive_effect": "Each time you take damage from yourself or a hostile source (even if that damage is reduced or ignored), gain +1 ARMOR for the rest of this scene after taking damage, up to a maximum of +6.",
      "passive_synergies": [{
        "locations": ["armor"],
        "detail": "Each time you take damage from yourself or a hostile source (even if that damage is reduced or ignored), gain +1 ARMOR for the rest of this scene after taking damage, up to a maximum of +6."
      }],
      "counters": [{
        "id": "ctr_ferroreactive_armor",
        "name": "FERROREACTIVE ARMOR",
        "default_value": 0,
        "min": 0,
        "max": 6
      }]
    },
    "data_type": "frame",
    "aptitude": {},
    "image_url": "https://compcon-image-assets.s3.amazonaws.com/frames/whitewitch.png"
  },
  {
    "id": "mf_emperor",
    "source": "SSC",
    "name": "EMPEROR",
    "mechtype": [
      "Support",
      "Artillery"
    ],
    "y_pos": 21,
    "license_level": 2,
    "description": "<p>&ldquo;In Exotic Materials we don&rsquo;t have problems: we have doors that are not yet open to us. A &lsquo;problem&rsquo; presents endless branching paths. Doors are binary. Open and shut. &lsquo;The tyranny of the problem lies in the impossible breadth of possibility.&rsquo; Smith said that. He went on to say that this is a useless framing for tinkerers and hobbyists whose ethics are defined by calcified, hand-wringing institutions. So! EXMAT is solutions-focused: there is no such thing as a problem, only a door, and the question: can we open it, or do we have to bash it down?</p> <p>Progress. Smith Shimano has always been about progress. Humanity has always been about progress. In service of progress, one must accept the necessity of teleological suspension.</p> <p>For the Emperor, after Hercynia, we had to bash the door down. Ugly process, but the riches beyond the door were more than worth it. Syncretic subjectivities, induced gestalt manifestation, H-NHP ontologic bridging, superpositional defensive lensing &ndash; look at what the battering ram gave us and tell me you&rsquo;d rather puzzle out a problem then bash down the door and grab all the gold.</p> <p>What else is there to say? Long live the Emperor, for in its creation did we find the method by which to fling open every locked door. Wondrous things are coming. I&rsquo;m glad that they&rsquo;ll be under our control.&rdquo;</p> <p>&ndash; Memo to personal records, Bala Shimano, CEO-1, Exotic Materials Group</p>",
    "mounts": [
      "Main"
    ],
    "stats": {
      "size": 1,
      "stress": 4,
      "structure": 4,
      "armor": 0,
      "hp": 2,
      "evasion": 10,
      "edef": 8,
      "heatcap": 5,
      "repcap": 2,
      "sensor_range": 15,
      "tech_attack": 1,
      "save": 11,
      "speed": 5,
      "sp": 7
    },
    "traits": [{
        "name": "Storm Shield",
        "description": "The Emperor’s HP is not increased by its pilots GRIT. Instead, at the start of any scene, the Emperor gains OVERSHIELD equal to 6+GRIT. This OVERSHIELD refreshes any time the Emperor takes structure damage",
        "bonuses": [{
          "id": "hp",
          "val": "-{grit}"
        }],
        "synergies": [{
          "locations": ["overshield"],
          "detail": "The Emperor’s HP is not increased by its pilots GRIT. Instead, at the start of any scene, the Emperor gains OVERSHIELD equal to 6+GRIT. This OVERSHIELD refreshes any time the Emperor takes structure damage"
        }]
      },
      {
        "name": "Imperial Vestment",
        "description": "Whenever the Emperor grants OVERSHIELD to another character, it gains the same amount of OVERSHIELD. If the Emperor gains OVERSHIELD from any source, including this trait, it increases its current OVERSHIELD by that amount instead of replacing it. Its OVERSHIELD cannot exceed the amount granted by Storm Shield.",
        "synergies": [{
          "locations": ["overshield"],
          "detail": "Whenever the Emperor grants OVERSHIELD to another character, it gains the same amount of OVERSHIELD. If the Emperor gains OVERSHIELD from any source, including this trait, it increases its current OVERSHIELD by that amount instead of replacing it. Its OVERSHIELD cannot exceed the amount granted by Storm Shield."
        }]
      },
      {
        "name": "Sovereign Presence",
        "description": "1/round, when the Emperor targets a character with an attack, it can condemn that character, forcing them to make an ENGINEERING save. On a failure, the target takes +1 damage any time they take damage until the start of the Emperor’s next turn.",
        "synergies": [{
          "locations": ["weapon", "active_effects"],
          "detail": "1/round, when the Emperor targets a character with an attack, it can condemn that character, forcing them to make an ENGINEERING save. On a failure, the target takes +1 damage any time they take damage until the start of the Emperor’s next turn."
        }]
      }
    ],
    "core_system": {
      "name": "Darian Regalia",
      "description": "&ldquo;Directed Subjective Convergence Weapon, Pattern 3. Or as Visual calls it, the 'Marathon Arc'. I suppose it is a better name. Imposing. Inaccurate, but Visual has never been accurate. The Arc forces realignment along a superpositional plane, destabilizing targets without the correct pineal hash while imparting sympathetic lensing on those with the correct hash; a simple 'weapon' that emulates an Overmind's corrective/imperative push.&ldquo;",
      "active_name": "Xerxes Apex",
      "active_effect": "For the rest of this scene, any mech targeted by an attack using the Marathon Arc Bow releases a bolt of lightning after the attack resolves, striking a character of your choice within RANGE 3, which can be the character it originated from. This lightning bolt either deals 2 AP damage (no attack or save) or increases the target’s OVERSHIELD by +2. The same character can be struck by multiple bolts.",
      "activation": "Protocol",
      "use": "Encounter",
      "integrated": ["mw_emperor_integrated"]
    },
    "data_type": "frame",
    "aptitude": {},
    "image_url": "https://compcon-image-assets.s3.amazonaws.com/frames/emperor.png"
  },
  {
    "id": "mf_black_witch_alt_orchidea",
    "source": "SSC",
    "variant": "BLACK WITCH",
    "name": "ORCHIS",
    "mechtype": [
      "Controller",
      "Defender"
    ],
    "y_pos": 25,
    "license_level": 2,
    "description": "The Orchis is the spear and shield of the house companies and makes up the bulk of the fighting forces in Baronic space. Its ubiquity does not bely its reliability and durability, nor its iconic status as the line mech of the baronies. Due to a trade negotiation with Smith-Shimano corpro, the Orchis is compatible with the Black Witch licensing scheme and can appropriate the majority of its gear and weaponry. Utilizing ancient and sturdy mag-lock technology, the Orchis wields a heavy Scuta shield, reinforced to deflect incoming fire. This shield can be locked in place and braced against another shield of its own kind, creating a tessellated wall of impenetrable strength. The half-mile long shield walls of the throne guard, blazoned with their house emblems, are an iconic and terrifying sight in Baronic history. The kuirassers of the Baronies decorate their Orchii with house heraldry, war banners, and trophies of past conflicts, each one the avatar resplendent with the regalia of a decorated warrior.",
    "mounts": [
      "Main/Aux"
    ],
    "stats": {
      "size": 1,
      "stress": 4,
      "structure": 4,
      "armor": 1,
      "hp": 8,
      "evasion": 10,
      "edef": 10,
      "heatcap": 6,
      "repcap": 4,
      "sensor_range": 10,
      "tech_attack": -1,
      "save": 12,
      "speed": 5,
      "sp": 8
    },
    "traits": [{
        "name": "Perfect Parry",
        "description": "The Orchis and all adjacent allied characters have IMMUNITY to all damage and effects from missed attacks.",
        "synergies": [{
          "locations": ["active_effects"],
          "detail": "The Orchis and all adjacent allied characters have IMMUNITY to all damage and effects from missed attacks."
        }]
      },
      {
        "name": "Guardian",
        "description": "Adjacent allied characters can use the Orchis for hard cover."
      },
      {
        "name": "Royal Guard",
        "description": "When an allied mech adjacent to the Orchis moves, the Orchis can also move with that character as long as it doesn’t break adjacency, mirroring that character’s movement. The Orchis is still affected by obstructions and, between its turns, can only move a total number of spaces with this ability equal to its SPEED+1.This effect doesn’t take a reaction, and doesn’t provoke reactions or obey engagement."
      }
    ],
    "core_system": {
      "name": "HELION",
      "description": "&ldquo;The man who took the reins of steel and became greater than man. The lowly one, the first, the greatest, the one who threw the sun at the face of his foes. IA! IA! Helion!&ldquo;",
      "active_name": "HELION",
      "active_effect": "You hurl your shield with a mighty throw at a mech (allied or hostile) within Range 6, making a special Ram attack that cannot miss and knocks the target 3 spaces back instead of 1. This can cause characters to collide with obstructions as normal. This action is <b>Efficient</b>, and refunds 1 Core Power at the end of any scene in which it’s used.",
      "activation": "Quick",
      "active_actions": [{
        "name": "Helion",
        "activation": "Quick",
        "detail": "The Orchis hurls its shield with a mighty throw at a mech (allied or hostile) within Range 6, making a special Ram attack that cannot miss and knocks the target 3 spaces back instead of 1. This can cause characters to collide with obstructions as normal. This action is <b>Efficient</b>, and refunds 1 Core Power at the end of any scene in which it’s used."
      }],
      "passive_name": "Hunting Eagle",
      "passive_effect": "1/round when the Orchis causes a character to collide with another obstacle or character, you can - in addition to any other effects - throw your mech's scuta shield at that character, dealing 3 kinetic damage and rendering them unable to take reactions until the end of their next turn. The shield then returns to you. This effect doesn’t take an action or reaction to activate.",
      "passive_actions": [{
        "name": "Hunting Eagle",
        "activation": "Free",
        "frequency": "1/round",
        "detail": "1/round when the Orchis causes a character to collide with another obstacle or character, you can - in addition to any other effects - throw your mech's scuta shield at that character, dealing 3 kinetic damage and rendering them unable to take reactions until the end of their next turn. The shield then returns to you. This effect doesn’t take an action or reaction to activate."
      }]

    },
    "data_type": "frame",
    "aptitude": {},
    "image_url": "https://compcon-image-assets.s3.amazonaws.com/frames/orchis.png"
  },
  {
    "id": "mf_minotaur_alt_wraith",
    "source": "HORUS",
    "variant": "MINOTAUR",
    "name": "CALENDULA",
    "mechtype": [
      "Controller"
    ],
    "y_pos": 25,
    "license_level": 2,
    "description": "A signature of the Order Xenoglossia’s Stygos Grammaton, the Royal Karrakin Foundries Calendula is derived from the Minotaur pattern group first released by HORUS. Oddly, it is unclear from temporal markers whether the codebase used to create the Calendula was created separately, before contact with Union, despite being nearly identical to the Minotaur codebase.<br>The Calendula uses the internal spatial manipulation abilities of the Minotaur and inverts them, allowing experienced pilots of the mech to cut into a ‘non-space’ widely regarded by Union theorists to be the Aunic Firmament. In this grey and bleak interstitial zone, matter appears as a flowing fog, and is just as easily parted.",
    "mounts": [
      "Main/Aux"
    ],
    "stats": {
      "size": 1,
      "stress": 4,
      "structure": 4,
      "armor": 2,
      "hp": 7,
      "evasion": 7,
      "edef": 10,
      "heatcap": 6,
      "repcap": 3,
      "sensor_range": 8,
      "tech_attack": 1,
      "save": 11,
      "speed": 4,
      "sp": 8
    },
    "traits": [{
        "name": "Sculptor of Fate",
        "description": "1/round, when the Calendula hits a character with a tech attack, it can create a void husk in a free space within RANGE 3 of its target. Void husks are INTANGIBLE objects that don’t cause obstruction. The husk is the same SIZE as its target, has IMMUNITY to all damage and effects, and emits a BURST 2 aura while active that affects both Intangible and tangible characters. Hostile characters are SLOWED while they are at least partly in the area. The Calendula can create any number of husks, all of which disintegrate at the end of the scene.",
        "synergies": [{
          "locations": ["tech_attack"],
          "detail": "1/round, when the Calendula hits a character with a tech attack, it can create a void husk in a free space within RANGE 3 of its target. Void husks are INTANGIBLE objects that don’t cause obstruction. The husk is the same SIZE as its target, has IMMUNITY to all damage and effects, and emits a BURST 2 aura while active that affects both Intangible and tangible characters. Hostile characters are SLOWED while they are at least partly in the area. The Calendula can create any number of husks, all of which disintegrate at the end of the scene."
        }],
        "deployables": [{
          "name": "Void Husk",
          "type": "Void Husk",
          "instances": 1,
          "evasion": "",
          "edef": "",
          "hp": "",
          "detail": "The <b>void husk</b> is an <b>intangible</b> object that doesn’t cause obstruction. The husk is the same size as its target, immune to all damage and effects, and emits a Burst 2 aura while active that affects both Intangible and tangible characters. Hostile characters are SLOWED while they are at least partly in the area."
        }]
      },
      {
        "name": "Grammaton Law",
        "description": "SLOWED hostile characters are also SHREDDED while within Range 3 of the Calendula."
      },
      {
        "name": "Grammaton Mantle",
        "description": "As a protocol, the Calendula can become INTANGIBLE until the start of its next turn.",
        "actions": [{
          "name": "Grammaton Mantle",
          "activation": "Protocol",
          "detail": "As a protocol, the Calendula can become INTANGIBLE until the start of its next turn."
        }]
      }
    ],
    "core_system": {
      "name": "Execration of the Names of the Unworthy Dead",
      "description": "&ldquo;I inscribe thy name, I threaten thee with the second death. I kill thy name, and this I kill thee again in the afterlife.&ldquo;",
      "active_name": "Weighing of Inequitable Hearts",
      "active_effect": "One hostile character and one allied character both within Range 5 and line of sight to you or a void husk, become INTANGIBLE until the end of your next turn. Two characters must be chosen for this effect to occur. This ability is <b>Efficient</b> and will refund 1 Core Point at the end of any scene in which this ability was used.",
      "activation": "Quick",
      "active_actions": [{
        "name": "Execration of the Names of the Unworthy Dead",
        "activation": "Quick",
        "detail": "One hostile character and one allied character both within Range 5 and line of sight to you or a void husk, become INTANGIBLE until the end of your next turn. Two characters must be chosen for this effect to occur. This ability is <b>Efficient</b> and will refund 1 Core Point at the end of any scene in which this ability was used."
      }],
      "passive_name": "Execrate",
      "passive_effect": "Gain the Execrate Quick Tech action.",
      "passive_actions": [{
        "name": "Execrate",
        "activation": "Quick Tech",
        "frequency": "1/round",
        "detail": "1/round You may target another character in line of sight within Range 3 of a void husk, banishing them to an interstitial space. Allied characters can choose whether or not to be affected, and hostile characters can avoid being affected by succeeding on a SYSTEMS save. Banished characters exist in a shadowy gray realm, making them INTANGIBLE.<br>This effect lasts until the banished character moves adjacent or starts their turn adjacent to a void husk, either of which returns them to physical space and clears INTANGIBLE."
      }]
    },
    "data_type": "frame",
    "aptitude": {},
    "image_url": "https://compcon-image-assets.s3.amazonaws.com/frames/calendula.png"
  }
]