[{
    "id": "ms_pinning_spire",
    "name": "PINNING SPIRE",
    "type": "System",
    "sp": 1,
    "source": "SSC",
    "license": "WHITE WITCH",
    "license_level": 1,
    "actions": [{
      "activation": "Quick",
      "detail": "You and one character within Range 3 and line of sight become Immobilized and cannot be moved in any way. For the duration, the target always considers you within range for melee attacks. On any subsequent turn, you can end this effect as a protocol, or your target can end it by successfully hitting you with a ranged or melee attack. This condition can’t be removed any other way."
    }],
    "description": "“We call it ‘demand-compliance tethering’. Though, that makes it sound as if they have a choice to resist.”",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_sympathetic_shield",
    "name": "SYMPATHETIC SHIELD",
    "type": "Shield",
    "sp": 2,
    "tags": [{
        "id": "tg_overshield"
      },
      {
        "id": "tg_shield"
      },
      {
        "id": "tg_limited",
        "val": 3
      }
    ],
    "source": "SSC",
    "license": "WHITE WITCH",
    "license_level": 2,
    "actions": [{
      "activation": "Quick",
      "detail": "You project a shield of resonant ferrofluid over an allied character within Range 5. They gain Overshield equal to half their maximum HP, but any damage dealt to this Overshield before reductions of any kind also deals equivalent kinetic damage to you as if the attacker had also damaged you, no matter how far away you are. This damage does not inherit tags or effects."
    }],
    "description": "“Soon enough we realized that shaping weapons from molecules and particles wasn’t enough to justify the conical mag as a system worth platforming. We needed to find a way to make it … more. More visual, tactile, concrete, imposing, thrilling – we needed to sell the next step in realspace control! So with some tuning and, regrettably, input from Visual, we figured out how to define the White Witch: as the most terrifying, alien thing you’ve ever fucking seen.”",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_camuss_razor",
    "name": "CAMUS’S RAZOR",
    "type": "Shield",
    "sp": 2,
    "tags": [{
        "id": "tg_unique"
      },
      {
        "id": "tg_shield"
      }
    ],
    "source": "SSC",
    "license": "WHITE WITCH",
    "license_level": 2,
    "actions": [{
      "name": "Prime Camus's Razor",
      "activation": "Quick",
      "detail": "Your mech is capable of projecting a spot-magnetic force of incredible power. You can prime this system as a quick action. Once primed, you gain the Intervention reaction for the rest of the scene."
    }, {
      "name": "Intervention",
      "activation": "Reaction",
      "frequency": "1/round",
      "init": "This system must be primed as a quick action.",
      "trigger": "An allied character within Range 5 and line of sight is targeted by an action that deals kinetic or explosive damage.",
      "detail": "You become the target of the action instead. If the action was an area of effect, such as a line, cone, blast, etc, the attacker must now position it so it targets you, or as close as possible, which could change its targets. This transfer takes place even if the original could not have hit you (i.e., it was a melee attack)."
    }],
    "description": "“Manipulating the world around the platform doesn’t end at rearranging the natural/built environment. This was the line that many on the team were afraid to cross, the question we had all asked ourselves once we bracketed the platform: what happens when we apply it to a person? What does existence mean when it can be ended with a thought?”",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_ferrospike_barrier",
    "name": "FERROSPIKE BARRIER",
    "type": "Deployable",
    "sp": 3,
    "source": "SSC",
    "license": "WHITE WITCH",
    "license_level": 3,
    "deployables": [{
      "name": "Ferrospike Barrier",
      "type": "Deployable",
      "activation": "Quick",
      "instances": 1,
      "size": 2,
      "hp": 20,
      "evasion": 5,
      "detail": "You spray a Size 2 surge of liquid metal in a free adjacent space, where it rapidly hardens into wicked spines. It doesn’t provide obstruction initially, but at the beginning of your next turn, it becomes a solid object (20 HP) that can be used for hard cover. The first time in a round any character would move into its space, that character takes 1d6 AP kinetic damage. You can only have one barrier deployed at a time; if a new one is deployed, the first one dissolves."
    }],
    "description": "“Again and again the meatheads over at Visual asked us to ‘help them sell’ the platform. What else could we do? We handed them a power that gods of death and war had coveted since Cain cracked a rock over Abel’s head, and they told us, ‘if we can’t see it, we can’t sell it.’ So we mucked around and made another diadematic little wonder for them, the F-Barrier. It’s brilliant. Of course it is. We’re Exotic Materials, brilliance is easy.”",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_dominions_breadth",
    "name": "DOMINION'S BREADTH",
    "type": "Tech",
    "sp": 2,
    "tags": [{
        "id": "tg_quick_tech"
      },
      {
        "id": "tg_overshield"
      },
      {
        "id": "tg_shield"
      },
      {
        "id": "tg_unique"
      }
    ],
    "source": "SSC",
    "license": "EMPEROR",
    "license_level": 1,
    "actions": [{
      "activation": "Quick Tech",
      "detail": "A mech character within Sensors and line of sight gains Overshield 1. When this Overshield is lost for any reason, that character releases a Burst 2 electric pulse. All hostile characters in the affected area (including the original character, if hostile), take 2 AP energy damage and must succeed on an Engineering save or become Impaired until the end of their next turn."
    }],
    "description": "“Our first door in was not, as we thought, from the subject’s neural mapping, but from an image of one of the igneomemetic samples returned by Perfect Execution during their deployment – Darius 1.11: The Golden Fulcrum. With it, we were able to crack the gestalt and begin to translate [Witness]; finding our way into the subject followed shortly thereafter.”",
    "data_type": "system",
    "aptitude": {}
  }, {
    "id": "ms_the_imperial_eye",
    "name": "THE IMPERIAL EYE",
    "type": "Tech",
    "sp": 2,
    "tags": [{
      "id": "tg_shield"
    }],
    "source": "SSC",
    "license": "EMPEROR",
    "license_level": 2,
    "actions": [{
      "activation": "Quick Tech",
      "detail": "An allied mech character within Sensors gains a Disruptive Charge until the start of your next turn. When a hostile character enters a space within Range 3 of the target, the Disruptive Charge sparks to that character and then dissipates. The character struck by the spark takes 2 AP energy damage and must succeed on an Engineering save or be knocked back 2 spaces, knocked Prone, and Shredded until the end of their next turn.<br>Characters that start their turns within Range 3 of the target are unaffected until they move outside of that area and re - enter it."
    }],
    "description": "Darius was the door in; Cyrus was the map. Navigation through the subject’s parasubjective topography was proven on paper. Using a particularized human-nonhuman ontologic bridge, EXMAT was able to demonstrate gestalt manifestation in test pilots; with help, we can do what they do — and do it better.<br>The walls between us and what comes next fall down. The work continues.",
    "data_type": "system",
    "aptitude": {}
  }, {
    "id": "ms_shahnameh",
    "name": "SHAHNAMEH",
    "type": "Tech",
    "sp": 3,
    "tags": [{
        "id": "tg_overshield"
      },
      {
        "id": "tg_shield"
      },
      {
        "id": "tg_limited",
        "val": 3
      },
      {
        "id": "tg_unique"
      }
    ],
    "source": "SSC",
    "license": "EMPEROR",
    "license_level": 2,
    "actions": [{
      "activation": "Quick Tech",
      "detail": "An allied mech character within Sensors and line of sight gains Overshield equal to half their maximum HP. While they have this Overshield, they have Resistance to heat inflicted by other characters. If they lose this Overshield for any reason, they clear all heat."
    }],
    "description": "“Be recorded in my book of Kings; live into forever and beyond.”<br>— translated gestalt from the Cyrus Omega ferromemetic, no pre-contact text associated; likely a subject-original imperative/corrective impulse.",
    "data_type": "system",
    "aptitude": {}
  }, {
    "id": "ms_ayah_of_the_syzygy",
    "name": "Āyah of the Syzygy",
    "type": "System",
    "sp": 2,
    "tags": [{
      "id": "tg_unique"
    }],
    "source": "SSC",
    "license": "EMPEROR",
    "license_level": 3,
    "actions": [{
      "activation": "Quick",
      "detail": "You create a Blast 2 energy field in a space within Range and line of sight. The first time each turn any hostile character in this area is hit by a ranged or melee attack, they release a discharge of energy and all hostile characters at least partly in the area – including the original character – take 2 AP energy damage. This effect lasts for the rest of the scene or until you take this action again."
    }],
    "description": "“So where are you going? Is your travel not just a reminder to the heavens? Go where thou wilt.”<br>— Witnessed from the Darius 4.8 ferromemetic",
    "data_type": "system",
    "aptitude": {}
  }, {
    "id": "ms_the_walk_of_kings",
    "name": "THE WALK OF KINGS",
    "type": "Tech",
    "sp": 3,
    "tags": [{
        "id": "tg_overshield"
      },
      {
        "id": "tg_shield"
      },
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_limited",
        "val": 3
      }
    ],
    "source": "SSC",
    "license": "EMPEROR",
    "license_level": 3,
    "actions": [{
      "activation": "Quick Tech",
      "detail": "An allied character within Sensors and line of sight gains Overshield equal to half their maximum HP. While they have this Overshield, all their melee attacks gain AP, and the first time each turn that they either hit with a melee attack or take damage from a hostile character, they release a Burst 1 energy blast centered on them. All hostile characters in the affected area take 1 AP energy damage."
    }],
    "description": "“AND IT WAS SO, that we saw His power, and burned under His glory, and wept, and no fortress could withstand our might.”<br>— Witnessed from the Darius 5.10 ferromemetic",
    "data_type": "system",
    "aptitude": {}
  }
]