[
  {
    "id": "mf_white_witch",
    "source": "SSC",
    "name": "WHITE WITCH",
    "mechtype": [
      "Defender"
    ],
    "y_pos": 28,
    "license_level": 2,
    "description": "<p>A proof-of-concept more than a line production chassis, a select few White Witch models have been released via Smith Shimano’s LUX-EXOTIC group, only available to select pilots outside of SSC’s Constellar security services. The White Witch builds from the platform established by the Black Witch; utilizing SSC’s magtech weapons and equipment, the White Witch takes the BW platform and tunes it for hyper-solipsistic focus, narrowing the effect cone to encompass only the WW and its pilot.</p><p>The White Witch marks SSC’s first foray into null-ordinance/ environmental manipulation chassis: when active, the WW’s entire chassis becomes a conduit for onboard base-compound magtech agitators to exploit its immediate environment, drawing atomic components out of natural, organic, and inorganic objects and surfaces to enhance its built-in defensive systems. The White Witch reorganizes these molecular draws using its chassis as substrate, quickly forming substantive defenses and weapons from “thin air”.</p><p>This process has understandably traumatic effects on organic and inorganic materials inside the immediate effect cone.</p>",
    "mounts": [
      "Flex",
      "Heavy"
    ],
    "stats": {
      "size": 2,
      "stress": 4,
      "structure": 4,
      "armor": 0,
      "hp": 7,
      "evasion": 10,
      "edef": 6,
      "heatcap": 4,
      "repcap": 5,
      "sensor_range": 5,
      "tech_attack": 0,
      "save": 11,
      "speed": 6,
      "sp": 6
    },
    "traits": [
      {
        "name": "Rooted",
        "description": "While this mech is immobilized, it has resistance to kinetic damage and cannot be knocked prone. It can immobilize itself until the end of its next turn as a quick action."
      },
      {
        "name": "Harden",
        "description": "When this mech braces, it gains overshield 5 before taking damage.",
        "synergies": [{
          "locations": ["brace"],
          "detail": "When this mech braces, it gains overshield 5 before taking damage."
        }]
      },
      {
        "name": "Guardian",
        "description": "Adjacent allied characters can use this mech as hard cover."
      }
    ],
    "core_system": {
      "name": "FERROREACTIVE SHELL",
      "description": "“The first test nearly ended the program. Exotic Materials is a... liberal department within the Constellation, but even our executives were hesitant to approve a second run. The data generated by WW_01 was invaluable, and we were sure we could get it right with a second test — all we needed was the sigma on its rewrite cone! Suits just get leery when systems fail. They forget that progress takes blood — sometimes literally — as payment for a breakthrough.”",
      "active_name": "Hyperactive mode",
      "active_effect": "<p>For the rest of this scene, your ferroreactive armor gain increases to 2, and its maximum armor increase is 12.</p><p>Each time your armor increases from this system, your mech releases a burst 1 aoe that deals 1 AP kinetic damage to all characters and objects in the zone, as it draws raw material from the environment.</p><p>However, if your ferroreactive armor would increase past 12, the armor explodes instead, dealing 1 AP kinetic damage in a burst 2 radius around your mech and causing all characters within to pass a hull save or be knocked prone, then immobilized and shredded until the end of their next turns. The ferroreactive armor is reset to 0. It continues to be active and this effect can occur multiple times a scene.</p>",
      "active_synergies": [{
        "locations": ["armor"],
        "detail": "<p>For the rest of this scene, your ferroreactive armor gain increases to 2, and its maximum armor increase is 12.</p><p>Each time your armor increases from this system, your mech releases a burst 1 aoe that deals 1 AP kinetic damage to all characters and objects in the zone, as it draws raw material from the environment.</p><p>However, if your ferroreactive armor would increase past 12, the armor explodes instead, dealing 1 AP kinetic damage in a burst 2 radius around your mech and causing all characters within to pass a hull save or be knocked prone, then immobilized and shredded until the end of their next turns. The ferroreactive armor is reset to 0. It continues to be active and this effect can occur multiple times a scene.</p>"
      }],
      "use": "Encounter",
      "activation": "Protocol",
      "passive_name": "Ferroreactive Armor",
      "passive_effect": "Each time this mech takes damage from a source owned by a hostile character (even if that damage is reduced or ignored), increase it’s armor by 1 for the rest of this scene, up to a maximum increase of 6 (you can use a die to track this).",
      "passive_synergies": [{
        "locations": ["armor"],
        "detail": "Each time this mech takes damage from a source owned by a hostile character (even if that damage is reduced or ignored), increase it’s armor by 1 for the rest of this scene, up to a maximum increase of 6 (you can use a die to track this)."
      }],
      "counters": [
        {
          "id": "ctr_ferroreactive_armor",
          "name": "FERROREACTIVE ARMOR",
          "default_value": 0,
          "min": 0,
          "max": 12
        }
      ]
    },
    "data_type": "frame",
    "aptitude": {},
    "image_url": "https://i.imgur.com/DQHJ8Sq.png"
  },
  {
    "id": "mf_black_witch_alt_orchidea",
    "source": "SSC",
    "variant": "BLACK WITCH",
    "name": "BARONIC INTEREST ORCHIS",
    "mechtype": [
      "Controller",
      "Defender"
    ],
    "y_pos": 25,
    "license_level": 2,
    "description": "Baronic Interest mech. This frame can be taken as an alternate frame for License Level 2 Black Witch.",
    "mounts": [
      "Main/Aux"
    ],
    "stats": {
      "size": 1,
      "stress": 4,
      "structure": 4,
      "armor": 1,
      "hp": 8,
      "evasion": 10,
      "edef": 10,
      "heatcap": 6,
      "repcap": 4,
      "sensor_range": 10,
      "tech_attack": -1,
      "save": 12,
      "speed": 5,
      "sp": 8
    },
    "traits": [
      {
        "name": "Perfect Parry",
        "description": "The Orchis is immune to all damage and effects from missed attacks. This effect extends to all adjacent allied characters.",
        "synergies": [{
          "locations": ["active_effects"],
          "detail": "The Orchis is immune to all damage and effects from missed attacks. This effect extends to all adjacent allied characters."
        }]
      },
      {
        "name": "Guardian",
        "description": "The Orchis can be used as hard cover by allied characters"
      },
      {
        "name": "Royal Guard",
        "description": "When an allied mech character adjacent to the Orchis moves, the Orchis can also move with that character as long as it doesn’t break adjacency, mirroring that character’s movement. This effect doesn’t take reaction to trigger, doesn’t provoke reactions or follow engagement, and can be taken on different characters. However, it must still obey obstruction and the Orchis can only move a total number of spaces with this ability between turns equal to its speed +1."
      }
    ],
    "core_system": {
      "name": "Charged Hoplon",
      "description": "",
      "active_name": "Ajax",
      "active_effect": "<b>Efficient:</b> This ability refunds 1 CP at the end of any scene in which it’s used.",
      "activation": "Quick",
      "active_actions": [{
        "name": "Ajax Ram",
        "activation": "Quick",
        "detail": "The Orchis hurls its shield with a mighty throw, targeting a mech character, allied or hostile, in range 6, making a special ram attack with +1 accuracy and knock back 3 instead of 1. This could cause characters to collide with obstructions as normal."
      }],
	    "passive_name": "Hunting Eagle",
      "passive_actions": [{
        "name": "Hunting Eagle",
        "activation": "Free",
        "frequency": "1/round",
        "detail": "1/round when the Orchis causes a character to collide with another obstacle or character, in addition to any other effects, it can throw its shield at that character, smashing into that character for 3 kinetic damage and causing that character to be unable to take reactions until the end of its next turn. The shield then returns to the Orchis. This effect doesn’t take an action or reaction to activate."
      }]

    },
    "data_type": "frame",
    "aptitude": {},
	"image_url": "https://i.imgur.com/4Os1ZCY.png"
  },
   {
    "id": "mf_minotaur_alt_wraith",
    "source": "HORUS",
    "variant": "MINOTAUR",
    "name": "B.I. WRAITH",
    "mechtype": [
      "Controller"
    ],
    "y_pos": 25,
    "license_level": 2,
    "description": "This frame can be taken as an alternate frame instead of the base frame at Minotaur License Level 2.",
    "mounts": [
      "Main/Aux"
    ],
    "stats": {
      "size": 1,
      "stress": 4,
      "structure": 4,
      "armor": 2,
      "hp": 7,
      "evasion": 7,
      "edef": 10,
      "heatcap": 6,
      "repcap": 3,
      "sensor_range": 8,
      "tech_attack": 1,
      "save": 11,
      "speed": 4,
      "sp": 8
    },
    "traits": [
      {
        "name": "Sculptor of Fate",
        "description": "1/round when the Wraith hits target with a tech attack, it can create a <b>void husk</b> in a free valid space in range 3 from its target, an <b>intangible</b> object that doesn’t cause obstruction. The husk is the same size as its target, immune to all damage and effects, and emits a burst 2 aura around it while active that effects all characters, intangible or not. Hostile characters are slowed while at least partly in the area. The Wraith can create any number of husks, though all disintegrate at the end of the scene.",
        "synergies": [{
          "locations": ["tech_attack"],
          "detail": "1/round when the Wraith hits target with a tech attack, it can create a <b>void husk</b> in a free valid space in range 3 from its target, an <b>intangible</b> object that doesn’t cause obstruction. The husk is the same size as its target, immune to all damage and effects, and emits a burst 2 aura around it while active that effects all characters, intangible or not. Hostile characters are slowed while at least partly in the area. The Wraith can create any number of husks, though all disintegrate at the end of the scene."
        }],
        "deployables": [{
          "name": "Void Husk",
          "type": "Void Husk",
          "instances": 1,
          "evasion": "",
          "edef": "",
          "hp": "",
          "detail": "The <b>void husk</b> is an <b>intangible</b> object that doesn’t cause obstruction. The husk is the same size as its target, immune to all damage and effects, and emits a burst 2 aura around it while active that effects all characters, intangible or not. Hostile characters are slowed while at least partly in the area."
        }]
      },
      {
        "name": "Grammaton Law",
        "description": "Slowed hostile characters are also Shredded while within range 3 of the Wraith."
      },
      {
        "name": "Grammaton Mantle",
        "description": "As a protocol, the Wraith becomes <b>intangible</b> until the start of its next turn.",
        "actions": [{
          "name": "Grammaton Mantle",
          "activation": "Protocol",
          "detail": "The Wraith becomes <b>intangible</b> until the start of its next turn."
        }]
      }
    ],
    "core_system": {
      "name": "Execration of the Names of the Unworthy Dead",
      "description": "",
      "active_name": "Weighing of Inequitable Hearts",
      "active_effect": "<b>Efficient:</b> Refund 1 CP at the end of any scene in which this ability was used.",
      "activation": "Quick",
      "active_actions": [{
        "name": "Execration of the Names of the Unworthy Dead",
        "activation": "Quick",
        "detail": "A hostile character and an allied character, both in range 5 and line of sight of the Wraith, become <b>intangible</b> until the end of your next turn. Both characters must be chosen for this move to be valid."
      }],
      "passive_name": "Execrate",
      "passive_actions": [{
        "name": "Execrate",
        "activation": "Quick Tech",
        "frequency": "1/round",
        "detail": "You may target another character in line of sight within range 3 and line of sight of a <b>void husk</b>, banishing them to an interstitial space. Allies can choose whether or not to be affected, enemies can pass a systems save to avoid being affected. A banished character exists in a shadowy gray realm and gains the <b>intangible</b> status.<br>Any banished character can immediately end the intangible effect on themselves by moving adjacent to or starting their turn adjacent to a void husk, returning to physical space and ending the intangible status."
      }]
    },
    "data_type": "frame",
    "aptitude": {},
	"image_url": "https://i.imgur.com/4Os1ZCY.png"
  }
]