[
  {
    "id": "mf_white_witch",
    "source": "SSC",
    "name": "WHITE WITCH",
    "mechtype": [
      "Defender"
    ],
    "y_pos": 28,
    "description": "A proof-of-concept more than a line production chassis, a select few White Witch models have been released via Smith Shimano’s LUX-EXOTIC group, only available to select pilots outside of SSC’s Constellar security services. The White Witch builds from the platform established by the Black Witch; utilizing SSC’s magtech weapons and equipment, the White Witch takes the BW platform and tunes it for hyper-solipsistic focus, narrowing the effect cone to encompass only the WW and its pilot.<br>The White Witch marks SSC’s first foray into null-ordinance/ environmental manipulation chassis: when active, the WW’s entire chassis becomes a conduit for onboard base-compound magtech agitators to exploit its immediate environment, drawing atomic components out of natural, organic, and inorganic objects and surfaces to enhance its built-in defensive systems. The White Witch reorganizes these molecular draws using its chassis as substrate, quickly forming substantive defenses and weapons from “thin air”.<br>This process has understandably traumatic effects on organic and inorganic materials inside the immediate effect cone.",
    "mounts": [
      "Flex",
      "Heavy"
    ],
    "stats": {
      "size": 2,
      "armor": 0,
      "hp": 7,
      "evasion": 10,
      "edef": 6,
      "heatcap": 4,
      "repcap": 5,
      "sensor_range": 5,
      "tech_attack": 0,
      "save": 11,
      "speed": 6,
      "sp": 6
    },
    "traits": [
      {
        "name": "Rooted",
        "description": "While this mech is immobilized, it has resistance to kinetic damage and cannot be knocked prone. It can immobilize itself until the end of its next turn as a quick action."
      },
      {
        "name": "Harden",
        "description": "When this mech braces, it gains overshield 5 before taking damage."
      },
      {
        "name": "Guardian",
        "description": "Adjacent allied characters can use this mech as hard cover."
      }
    ],
    "core_system": {
      "name": "FERROREACTIVE SHELL",
      "description": "“The first test nearly ended the program. Exotic Materials is a... liberal department within the Constellation, but even our executives were hesitant to approve a second run. The data generated by WW_01 was invaluable, and we were sure we could get it right with a second test — all we needed was the sigma on its rewrite cone! Suits just get leery when systems fail. They forget that progress takes blood — sometimes literally — as payment for a breakthrough.”",
      "active_name": "Hyperactive mode",
      "active_effect": "For the rest of this scene, your ferroreactive armor gain increases to 2, and its maximum armor increase is 12.<br>Each time your armor increases from this system, your mech releases a burst 1 aoe that deals 1 AP kinetic damage to all characters and objects in the zone, as it draws raw material from the environment.<br>However, if your ferroreactive armor would increase past 12, the armor explodes instead, dealing 1 AP kinetic damage in a burst 2 radius around your mech and causing all characters within to pass a hull save or be knocked prone, then immobilized and shredded until the end of their next turns. The ferroreactive armor is reset to 0. It continues to be active and this effect can occur multiple times a scene.",
      "tags": [
        {
          "id": "tg_protocol"
        }
      ],
      "passive_name": "Ferroreactive Armor",
      "passive_effect": "Each time this mech takes damage from a source owned by a hostile character (even if that damage is reduced or ignored), increase it’s armor by 1 for the rest of this scene, up to a maximum increase of 6 (you can use a die to track this)."
    },
    "data_type": "frame",
    "aptitude": {},
    "image_url": "https://i.imgur.com/DQHJ8Sq.png",
    "counters": [
      {
        "id": "ctr_ferroreactive_armor",
        "name": "FERROREACTIVE ARMOR",
        "default_value": 0,
        "min": 0,
        "max": 12
      }
    ]
  },
  {
    "id": "mf_emperor",
    "source": "SSC",
    "name": "EMPEROR",
    "mechtype": [
      "Support",
      "Artillery"
    ],
    "y_pos": 10,
    "description": "",
    "mounts": [
      "Main"
    ],
    "stats": {
      "size": 1,
      "armor": 0,
      "hp": 5,
      "evasion": 10,
      "edef": 8,
      "heatcap": 5,
      "repcap": 1,
      "sensor_range": 20,
      "tech_attack": 1,
      "save": 11,
      "speed": 5,
      "sp": 7
    },
    "traits": [
      {
        "name": "Siege Armor",
        "description": "The Emperor has resistance to all damage originating from over range 3"
      },
      {
        "name": "Storm circuits",
        "description": "1/round when the Emperor hits or is hit by a melee or ranged attack, it can release a burst 1 aoe that deals 1 energy damage to all characters other than the Emperor caught within the area."
      }
    ],
    "core_system": {
      "name": "Arc Charger",
      "description": "",
      "active_name": "Supercharge",
      "active_effect": "For the rest of this scene, the arc bow deals 2 damage and increases overshield by 2 for each character size 1 or larger caught in in its area of effect, up to a maximum of 10 damage and +10 overshield. It’s overshield increase cap remains 10.",
      "tags": [],
      "integrated": {
        "id": "mw_emperor_integrated"
      }
    },
    "data_type": "frame",
    "aptitude": {},
    "image_url": ""
  }
]