[
  {
    "id": "mf_emperor",
    "source": "SSC",
    "name": "EMPEROR",
    "mechtype": [
      "Support",
      "Artillery"
    ],
    "y_pos": 21,
    "license_level": 2,
    "description": "<p>“In Exotic Materials we don’t have problems. We have doors that are not yet open to us — a ‘problem’ presents endless branching paths; ‘doors’ are binary. Open and shut. The tyranny of the problem lies in the impossible breadth of possibility — a useless framing for tinkerers and hobbyists with time to fret over ethics as-defined by calcified, hand-wringing institutions. EXMAT instead is solutions-focused: there is no such thing as a problem, only a door, and the question: can we open it, or do we have to bash it down?</p><p>For the Emperor we had to bash the door down. Ugly process but the content beyond the door is more than worth it: Syncretic subjectivities, induced gestalt manifestation, H-NHP ontologic bridging, superpositional defensive lensing — look at what the battering ram gave us and tell me you’d rather puzzle out a problem then bash down the door.</p><p>Progress. The Corpro has always been about progress. Humanity has always been about progress. In service of progress, one must accept the necessity of teleological suspension, for it gives us wondrous, necessary things.</p><p>What else is there to say? Long live the Emperor, for in its creation did we find the method by which to fling open every locked door. Wondrous things are coming, and I’m glad as hell that they’ll be under our control.”</p><p>— Memo to personal records, Bala Shimano, CEO-1, Exotic Materials Group</p>",
    "mounts": [
      "Main"
    ],
    "stats": {
      "size": 1,
      "stress": 4,
      "structure": 4,
      "armor": 0,
      "hp": 2,
      "evasion": 10,
      "edef": 8,
      "heatcap": 5,
      "repcap": 2,
      "sensor_range": 15,
      "tech_attack": 1,
      "save": 11,
      "speed": 5,
      "sp": 7
    },
    "traits": [
      {
        "name": "Storm Shield",
        "description": "The Emperor’s hp does not increase due to grit. Instead, at the start of any scene, the Emperor gains overshield equal to 6 + its grit. This overshield refreshes when the Emperor takes structure damage.",
        "bonuses": [{
          "id": "hp",
          "val": "-{grit}"
        }],
        "synergies": [{
          "locations": ["overshield"],
          "detail": "The Emperor’s hp does not increase due to grit. Instead, at the start of any scene, the Emperor gains overshield equal to 6 + its grit. This overshield refreshes when the Emperor takes structure damage."
        }]
      },
      {
        "name": "Imperial Vestment",
        "description": "Whenever the Emperor grants overshield to another character, it gains the same amount of overshield. If the Emperor gains overshield from any source, including this trait, it increases its current overshield by that amount instead of replacing it. In addition, if that overshield had effects, it can inherit those effects, but only the effects of one system at a time (you can choose which is kept or replaced). The Emperor’s current overshield cannot exceed the amount granted by Storm Shield.",
        "synergies": [{
          "locations": ["overshield"],
          "detail": "Whenever the Emperor grants overshield to another character, it gains the same amount of overshield. If the Emperor gains overshield from any source, including this trait, it increases its current overshield by that amount instead of replacing it. In addition, if that overshield had effects, it can inherit those effects, but only the effects of one system at a time (you can choose which is kept or replaced). The Emperor’s current overshield cannot exceed the amount granted by Storm Shield."
        }]
      },
      {
        "name": "Sovereign Presence",
        "description": "1/round, when the Emperor hits or is hit by a melee or ranged attack, it can release a burst 1 AOE around itself (if it was hit) or its target (if it was the attacker) that deals 1 AP energy damage to all characters caught within other than the Emperor.",
        "synergies": [{
          "locations": ["weapon", "active_effects"],
          "detail": "1/round, when the Emperor hits or is hit by a melee or ranged attack, it can release a burst 1 AOE around itself (if it was hit) or its target (if it was the attacker) that deals 1 AP energy damage to all characters caught within other than the Emperor."
        }]
      }
    ],
    "core_system": {
      "name": "Darian Regalia",
      "description": "",
      "active_name": "Xerxes Apex",
      "active_effect": "For the rest of this scene, when the Marathon Arc is drawn back, each hostile mech character hit and each allied mech character granted overshield by the bow releases a bolt of lightning, striking a character in range 3, which could be the character it originated from. This lightning bolt either deals 2 AP damage (no attack or save) or grants 2 overshield (or increases overshield by the same amount). The same character can be struck by multiple bolts.",
      "activation": "Free",
      "use": "Encounter",
      "integrated": ["mw_emperor_integrated"]
    },
    "data_type": "frame",
    "aptitude": {},
    "image_url": "https://i.imgur.com/BGu6Vg6.png"
  }
]