[
  {
    "id": "t_demolitionist",
    "name": "DEMOLITIONIST",
    "description": "Explosives and warfare go together like alcohol and bad decisions. The power of a bomb in the palm of your hand is a great equalizer, and a well-placed satchel charge or two has brought even the mightiest of fortifications tumbling down. Forget bullets with names etched on them, the packages you deliver go out addressed “To Whom It May Concern,” and you’ve got plenty to go around.",
    "ranks": [
      {
        "name": "Frag and Clear",
        "description": "When you use a Grenade, you may choose one character in the affected area to ignore its effects. Additionally, at the end of each scene, you restore 1 charge to each Limited system with the Mine tag for each undetonated Mine you deployed from that system."
      },
      {
        "name": "Quarterback",
        "description": "Your Grenades gain +3 Range, and you can plant Mines up to Range 3 (or add +3 Range to them if they have one). Additionally, you do not require line of sight for Grenades and Mines as long as it’s possible to trace a path to the target."
      },
      {
        "name": "Fire in the Hole",
        "description": "<p>Your explosive charges have been enhanced with customized payloads. 1/round, you may choose one of the following:</p> <ul> <li>When you throw a Grenade, up to three characters within Range 3 of the targeted space take 2 explosive damage and are knocked back 1 space in a direction of your choice by explosive shrapnel.</li> <li>When a character fails a save against one of your Mines, they take +1d6 explosive bonus damage. If the mine deals no damage normally when detonated, whether it forces a save or not, one character in the affected area takes 1d6 explosive damage instead.</li> </ul>"
      }
    ]
  },
  {
    "id": "t_sysop",
    "name": "SYSOP",
    "terse": "",
    "description": "Modern systemic warfare is a filthy mess of code-worms, logic bombs, and adaptive viruses, to say nothing of all the physical detritus that litters the battlefield, and you’re the one responsible for keeping things clean. System operator or system optimizer, formatting software barriers or tuning servos, your command of diagnostic programs and deep-level hardware overrides gives you all the tools you need to push your squad’s limits beyond manufacturer spec with orderly, surgical precision.",
    "ranks": [
      {
        "name": "Inoculation",
        "description": "When you Bolster an allied character, the additional Accuracy they gain lasts until their next skill check or save.",
        "synergies": [
          {
            "locations": ["bolster"],
            "detail": "When you Bolster an allied character, the additional Accuracy they gain lasts until their next skill check or save."
          }
        ]
      },
      {
        "name": "Firewall",
        "description": "When you Bolster an allied character, tech attacks against them receive +1 Difficulty until the end of their next turn",
        "synergies": [
          {
            "locations": ["bolster"],
            "detail": "When you Bolster an allied character, tech attacks against them receive +1 Difficulty until the end of their next turn"
          }
        ]
      },
      {
        "name": "Aggressive Countermeasures",
        "description": "1/round, when you Bolster an ally, you induce a special cycle into their reactor. They reduce the next amount of heat they would take from a hostile character to 0, and that character takes 2 heat and becomes Impaired until the end of their next turn. This effect does not stack, and lasts until triggered.",
        "synergies": [
          {
            "locations": ["bolster"],
            "detail": " 1/round, when you Bolster an allied character, you induce a special cycle in their reactor. They reduce the next amount of heat they would take from a hostile character to 0, and that character takes 2 heat and becomes Impaired until the end of their next turn. This effect does not stack, and lasts until triggered."
          }
        ]
      }
    ]
  }
]
