[
  {
    "id": "mw_xc_br_battle_rifle",
    "name": "XC-BR Battle Rifle",
    "source": "EXOTIC",
    "license": "",
    "license_level": 0,
    "description": "The GMS MC-AR assault rifle currently in use throughout Union’s forces and beyond is a time-tested and reliable design. Rather than attempting to replace it outright, CentComm's Defense Logistics Committee has put out a call for a supplementary standardized battle rifle system that can operate alongside the MC-AR in mixed fireteams, or as a primary weapon system for engaging heavily armored opposition at longer ranges than the MC-TR thermal rifle. The XC-BR uses an advanced caseless electrochemical propellant design capable of firing larger-caliber, armor-defeating rounds while minimizing recoil along with an integrated dynamic targeting system, though the weapon is still plagued by intermittent heat issues that can adversely affect performance.</p>",
    "effect": "You may attack characters with the Lock On condition using this weapon as though it is range 15.",
    "on_attack": "",
    "on_hit": "",
    "on_crit": "The target becomes Locked On",
    "mount": "Main",
    "type": "Rifle",
    "cost": 1,
    "barrage": true,
    "skirmish": true,
    "damage": [{ "type": "Kinetic", "val": "1d6" }],
    "range": [{ "type": "Range", "val": 10 }],
    "sp": 0,
    "tags": [{ "id": "tg_ap" }, { "id": "tg_overkill" }, { "id": "tg_exotic" }]
  },
  {
    "id": "mw_xc_dpm_predator_nexus",
    "name": "XC-DPM Predator Nexus",
    "source": "EXOTIC",
    "license": "",
    "license_level": 0,
    "description": "<p>One of GMS’s most advanced nexus weapons currently undergoing field-testing, the XC-DPM Predator project is the direct descendant of the earlier MC-DHK Hunter-Killer program, itself a joint venture between the Advanced Projects Special Research Agency and GMS engineers. The Predator nexus benefits from a comprehensive targeting and autonomy upgrade, incorporating MD+ “Muse Drive” smart weapon design. This system’s heuristics, though declared Turing-Null, display startlingly advanced target acquisition capabilities even when confronted with active countermeasures that might otherwise confound traditional smart weapon platforms.</p>",
    "effect": "Attacks with this weapon ignore Invisible",
    "on_attack": "",
    "on_hit": "",
    "on_crit": "",
    "mount": "Main",
    "type": "Nexus",
    "cost": 1,
    "barrage": true,
    "skirmish": true,
    "damage": [{ "type": "Kinetic", "val": "1d6" }],
    "range": [{ "type": "Range", "val": 10 }],
    "sp": 0,
    "tags": [
      { "id": "tg_accurate" },
      { "id": "tg_smart" },
      { "id": "tg_exotic" }
    ]
  }
]
