[
  {
    "id": "mf_white_witch",
    "source": "SSC",
    "name": "WHITE WITCH",
    "mechtype": [
      "Defender"
    ],
    "y_pos": 28,
    "license_level": 2,
    "description": "<p>A proof-of-concept more than a line production chassis, a select few White Witch models have been released via Smith Shimano’s LUX-EXOTIC group, only available to select pilots outside of SSC’s Constellar security services. The White Witch builds from the platform established by the Black Witch; utilizing SSC’s magtech weapons and equipment, the White Witch takes the BW platform and tunes it for hyper-solipsistic focus, narrowing the effect cone to encompass only the WW and its pilot.</p><p>The White Witch marks SSC’s first foray into null-ordinance/ environmental manipulation chassis: when active, the WW’s entire chassis becomes a conduit for onboard base-compound magtech agitators to exploit its immediate environment, drawing atomic components out of natural, organic, and inorganic objects and surfaces to enhance its built-in defensive systems. The White Witch reorganizes these molecular draws using its chassis as substrate, quickly forming substantive defenses and weapons from “thin air”.</p><p>This process has understandably traumatic effects on organic and inorganic materials inside the immediate effect cone.</p>",
    "mounts": [
      "Flex",
      "Heavy"
    ],
    "stats": {
      "size": 2,
      "stress": 4,
      "structure": 4,
      "armor": 0,
      "hp": 7,
      "evasion": 10,
      "edef": 6,
      "heatcap": 4,
      "repcap": 5,
      "sensor_range": 5,
      "tech_attack": 0,
      "save": 11,
      "speed": 6,
      "sp": 6
    },
    "traits": [
      {
        "name": "Rooted",
        "description": "While this mech is immobilized, it has resistance to kinetic damage and cannot be knocked prone. It can immobilize itself until the end of its next turn as a quick action."
      },
      {
        "name": "Harden",
        "description": "When this mech braces, it gains overshield 5 before taking damage.",
        "synergies": [{
          "locations": ["brace"],
          "detail": "When this mech braces, it gains overshield 5 before taking damage."
        }]
      },
      {
        "name": "Guardian",
        "description": "Adjacent allied characters can use this mech as hard cover."
      }
    ],
    "core_system": {
      "name": "FERROREACTIVE SHELL",
      "description": "“The first test nearly ended the program. Exotic Materials is a... liberal department within the Constellation, but even our executives were hesitant to approve a second run. The data generated by WW_01 was invaluable, and we were sure we could get it right with a second test — all we needed was the sigma on its rewrite cone! Suits just get leery when systems fail. They forget that progress takes blood — sometimes literally — as payment for a breakthrough.”",
      "active_name": "Hyperactive mode",
      "active_effect": "<p>For the rest of this scene, your ferroreactive armor gain increases to 2, and its maximum armor increase is 12.</p><p>Each time your armor increases from this system, your mech releases a burst 1 aoe that deals 1 AP kinetic damage to all characters and objects in the zone, as it draws raw material from the environment.</p><p>However, if your ferroreactive armor would increase past 12, the armor explodes instead, dealing 1 AP kinetic damage in a burst 2 radius around your mech and causing all characters within to pass a hull save or be knocked prone, then immobilized and shredded until the end of their next turns. The ferroreactive armor is reset to 0. It continues to be active and this effect can occur multiple times a scene.</p>",
      "active_synergies": [{
        "locations": ["armor"],
        "detail": "<p>For the rest of this scene, your ferroreactive armor gain increases to 2, and its maximum armor increase is 12.</p><p>Each time your armor increases from this system, your mech releases a burst 1 aoe that deals 1 AP kinetic damage to all characters and objects in the zone, as it draws raw material from the environment.</p><p>However, if your ferroreactive armor would increase past 12, the armor explodes instead, dealing 1 AP kinetic damage in a burst 2 radius around your mech and causing all characters within to pass a hull save or be knocked prone, then immobilized and shredded until the end of their next turns. The ferroreactive armor is reset to 0. It continues to be active and this effect can occur multiple times a scene.</p>"
      }],
      "use": "Encounter",
      "activation": "Protocol",
      "passive_name": "Ferroreactive Armor",
      "passive_effect": "Each time this mech takes damage from a source owned by a hostile character (even if that damage is reduced or ignored), increase it’s armor by 1 for the rest of this scene, up to a maximum increase of 6 (you can use a die to track this).",
      "passive_synergies": [{
        "locations": ["armor"],
        "detail": "Each time this mech takes damage from a source owned by a hostile character (even if that damage is reduced or ignored), increase it’s armor by 1 for the rest of this scene, up to a maximum increase of 6 (you can use a die to track this)."
      }],
      "counters": [
        {
          "id": "ctr_ferroreactive_armor",
          "name": "FERROREACTIVE ARMOR",
          "default_value": 0,
          "min": 0,
          "max": 12
        }
      ]
    },
    "data_type": "frame",
    "aptitude": {},
    "image_url": "https://i.imgur.com/DQHJ8Sq.png"
  },
  {
    "id": "mf_black_witch_alt_orchidea",
    "source": "SSC",
    "variant": "BLACK WITCH",
    "name": "ORCHIDEA",
    "mechtype": [
      "Controller",
      "Defender"
    ],
    "y_pos": 25,
    "license_level": 2,
    "description": "Baronic Interest mech. This frame can be taken as an alternate frame for License Level 2 Black Witch.",
    "mounts": [
      "Main/Aux"
    ],
    "stats": {
      "size": 1,
      "stress": 4,
      "structure": 4,
      "armor": 1,
      "hp": 6,
      "evasion": 10,
      "edef": 12,
      "heatcap": 6,
      "repcap": 3,
      "sensor_range": 15,
      "tech_attack": -1,
      "save": 12,
      "speed": 5,
      "sp": 8
    },
    "traits": [
      {
        "name": "KINETIC DENIAL",
        "description": "The Orchidea is immune to kinetic damage. This trait deactivates if the Orchidea is hit by an attack that deals any amount of kinetic damage. It reactivates at the end of its next turn.",
        "synergies": [{
          "locations": ["active_effects"],
          "detail": "The Orchidea is immune to kinetic damage. This trait deactivates if the Orchidea is hit by an attack that deals any amount of kinetic damage. It reactivates at the end of its next turn."
        }]
      },
      {
        "name": "HOPLON THROW",
        "description": "As a quick action, the Orchidea can throw its shield at any character in range 5 and line of sight as a ranged attack. On hit, the character is knocked Prone, Slowed, and loses any Resistance to kinetic damage it has. These effects last until the end of its next turn.",
        "actions": [{
          "name": "Hoplon Throw",
          "activation": "Quick",
          "detail": "The Orchidea can throw its shield at any character in range 5 and line of sight as a ranged attack. On hit, the character is knocked Prone, Slowed, and loses any Resistance to kinetic damage it has. These effects last until the end of its next turn."
        }]
      }
    ],
    "core_system": {
      "name": "Charge Hoplon",
      "description": "",
      "active_name": "Wrath of the Ancients",
      "active_effect": "When this action is taken, and for the rest of the scene as a quick action, the Orchidea gains 1 charge in charged Hoplon and can repeat the activation effect of its shield. Characters that fail the Hull save additionally take 2 kinetic damage and are Stunned until the end of their next turn instead of knocked Prone when they collide with other characters or objects, though they can only be Stunned this way once a scene and are knocked Prone if they suffer this effect again.",
      "activation": "Quick",
      "active_actions": [{
        "name": "Wrath of the Ancients",
        "activation": "Quick",
        "detail": "The Orchidea gains 1 charge in charged Hoplon and can repeat the activation effect of its shield. Characters that fail the Hull save additionally take 2 kinetic damage and are Stunned until the end of their next turn instead of knocked Prone when they collide with other characters or objects, though they can only be Stunned this way once a scene and are knocked Prone if they suffer this effect again."
      }],
	    "passive_name": "Charged Hoplon",
      "passive_effect": "When the Orchidea or any adjacent ally is hit by an attack or effect that deals at least partly kinetic damage, it stores a charge in its Hoplon. It can store up to 6 charges at once (you can use a die to track this), carrying over between scenes, and loses all charges on a Full Repair.",
      "passive_actions": [
        {
          "name": "Hoplon Field",
          "activation": "Full",
          "detail": "<p>As a full action, the Orchidea can spend any number of charges in its Hoplon to create a shimmering magnetic field in any space with at least 1 square sharing its space with Size equal to the number of charges expended. The shield has the following effects:<ul><li>Allied characters inside have Resistance to kinetic damage.</li><li>Hostile characters inside the area are Slowed and cannot take reactions.</li></ul><p>Additionally, when the shield is activated, hostile characters inside its area of effect must pass a Hull save or be pushed outside of its space, or as far as possible otherwise. If this movement would force them to collide with an obstacle or another character, they are additionally knocked Prone.</p><p>The shield lasts until the end of the scene or until this action is taken again.</p>"
        },
        {
        "name": "Expand Hoplon Field",
        "activation": "Protocol",
        "detail": "The Orchidea can spend any number of Hoplon charges while inside the shield as a protocol to increase its Size by 1 per charge spent, up to a maximum of Size 6."
        }
      ]
    },
    "data_type": "frame",
    "aptitude": {},
	"image_url": "https://i.imgur.com/4Os1ZCY.png",
	 "counters": [
      {
        "id": "ctr_orchidea_hoplon",
        "name": "HOPLON DIE",
        "default_value": 1,
        "min": 1,
        "max": 6
      }
    ]
  },
   {
    "id": "mf_minotaur_alt_wraith",
    "source": "HORUS",
    "variant": "MINOTAUR",
    "name": "WRAITH",
    "mechtype": [
      "Controller"
    ],
    "y_pos": 25,
    "license_level": 2,
    "description": "Ungrateful pattern group. This frame can be taken as an alternate frame instead of the base frame at Minotaur License Level 2.",
    "mounts": [
      "Main/Aux"
    ],
    "stats": {
      "size": 1,
      "stress": 4,
      "structure": 4,
      "armor": 2,
      "hp": 7,
      "evasion": 7,
      "edef": 10,
      "heatcap": 6,
      "repcap": 3,
      "sensor_range": 8,
      "tech_attack": 1,
      "save": 11,
      "speed": 4,
      "sp": 8
    },
    "traits": [
      {
        "name": "LEAVE HUSK",
        "description": "1/round as a quick action, the Wraith can crystallize space around itself. When it next moves out of the space it occupies, it leaves behind a Void Husk, an object with the same Size as itself. Husks have 6+Grit HP, Evasion 5 and E-defense 5. The husk emits a Burst 2 aura around it while active. Hostile characters are Slowed while at least partly in the area. The Wraith can create any number of husks, though all disintegrate at the end of the scene.",
        "actions": [{
          "name": "Leave Husk",
          "activation": "Quick",
          "frequency": "1/round",
          "detail": "The Wraith can crystallize space around itself. When it next moves out of the space it occupies, it leaves behind a Void Husk."
        }],
        "deployables": [{
          "name": "Void Husk",
          "type": "Void Husk",
          "instances": 1,
          "evasion": 5,
          "edef": 5,
          "hp": "6+{grit}",
          "detail": "The husk emits a Burst 2 aura around it while active. Hostile characters are Slowed while at least partly in the area. The Wraith can create any number of husks, though all disintegrate at the end of the scene."
        }]
      },
      {
        "name": "LAW OF THE DEAD",
        "description": "Slowed hostile characters are also Shredded while within range 3 of the Wraith."
      },
      {
        "name": "SUPPLICATION BEFORE THE CRESCENT HORNS",
        "description": "As a protocol, the Wraith can take 2 Heat and become Intangible (see below) until the end of its current turn.",
        "actions": [{
          "name": "Supplication Before the Crescent Horns",
          "activation": "Protocol",
          "heat_cost": 2,
          "detail": "As a protocol, the Wraith can take 2 Heat and become Intangible (see below) until the end of its current turn."
        }]
      }
    ],
    "core_system": {
      "name": "Execration of the Names of the Unworthy Dead",
      "description": "",
      "active_name": "Weighing of Inequitable Hearts",
      "active_effect": "For the rest of this scene, gain the <b>Intangibility</b> protocol.",
      "activation": "Quick",
      "active_actions": [{
        "name": "Intangibility",
        "activation": "Protocol",
        "detail": "Up to two characters of your choice within line of sight and Range 5 of either you or a Void Husk become Intangible (no save). They can end this status as above."
      }],
      "passive_name": "Execrate",
      "passive_effect": "Gain the <b>Execrate</b> quick tech option.",
      "passive_actions": [{
        "name": "Execrate",
        "activation": "Quick Tech",
        "frequency": "1/round",
        "detail": "You may target another character in line of sight within Range 5 of either your mech or a Void Husk, and attempt to banish them to an interstitial space. Allies can choose whether or not to be affected, enemies can pass a Systems save to avoid being affected. A banished character exists in a shadowy gray realm and gains the Intangible status. While Intangible, you can move through obstructions but not end your turn in them. An Intangible character cannot interact with or target any other object or character or be interacted with or targeted (eg taking or dealing damage) in any way. There is one exception to this rule - Intangible characters can interact with each other normally. Any banished character can immediately end the Intangible effect on themselves by moving adjacent to or starting their turn adjacent to either your mech or a Void Husk returning to physical space. If neither your mech or any husks remain on the battlefield, this effect ends on all characters."
      }]
    },
    "data_type": "frame",
    "aptitude": {},
	"image_url": "https://i.imgur.com/4Os1ZCY.png"
  }
]